# GetBarModelDiameter Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarUpdateCurvesData..::..GetBarModelDiameter Method
RebarUpdateCurvesData Class See Also
---
Gets the model diameter of the Rebar.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public double GetBarModelDiameter()
```

Visual Basic
---
```text
Public Function GetBarModelDiameter As Double
```

Visual C++
---
```text
public:
double GetBarModelDiameter()
```

# ### Return Value
Returns the model diameter of the Rebar.
# See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace